// ============================================================================
// ==                   Copyright (c) 2015, Smirnov Denis                    ==
// ==                  See license.txt for more information                  ==
// ============================================================================
#pragma once
#ifndef RenderSector_h__
#define RenderSector_h__

/// Рисует сектор.
/// Поток логики: Если установлен флаг, пробегаем по всем блокам, запрашиваем рендер агента,
/// у рендер агента запрашиваем модель, сливаем все в один буфер.
/// Поток рендера: Затем компилируем и рисуем.
class RenderSector
{
public:
  RenderSector();
  ~RenderSector();
};



#endif // RenderSector_h__